Расширение_ЛаРС_Доработки_Бух/Catalogs/ЛаРС_Иски.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЛаРС_Иски</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаИска</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСудебногоРешения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСудебногоРешения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодЗадолженности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Госпошлина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаЗадолженности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияЗадолженности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛаРС_Улицы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дом</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛаРС_Дома</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛаРС_Квартиры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>450</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Расширение_ЛаРС_Доработки_Бух/Catalogs/ЛаРС_Иски/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура УстановитьДатаНомерСудебногоРешенияПриИзменении()
	//ЭтаФорма.Объект.Наименование=СокрЛП(ЭтаФорма.Элементы.НомерСудебногоРешения.ТекстРедактирования)
	//+" от "+Формат(Элементы.ДатаСудебногоРешения.ТекстРедактирования)
	//+" "+Формат(Элементы.Ответчик.ТекстРедактирования)
	//;
	
	Объект.Наименование=СокрЛП(Объект.НомерСудебногоРешения)
	+" от "+Формат(Объект.ДатаСудебногоРешения,"ДФ=dd.MM.yyyy")
	+" "+СокрЛП(Объект.Ответчик);
	
КонецПроцедуры


&НаКлиенте
Процедура ДатаСудебногоРешенияПриИзменении(Элемент)
	УстановитьДатаНомерСудебногоРешенияПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура НомерСудебногоРешенияПриИзменении(Элемент)
	УстановитьДатаНомерСудебногоРешенияПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура ОтветчикПриИзменении(Элемент)
	УстановитьДатаНомерСудебногоРешенияПриИзменении();
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(Объект.Квартира) Тогда
		Объект.Адрес=СокрЛП(Объект.Квартира.Дом.Улица.Наименование)
		+" д."	+СокрЛП(Объект.Квартира.Дом.НомерДома)
		+" кв." +СокрЛП(Объект.Квартира.Номер);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура УлицаПриИзмененииНаСервере()

	Объект.АдресСтрокой = "" + Объект.Улица + ", д." + Объект.Дом + ", кв." + Объект.Квартира;

КонецПроцедуры

&НаКлиенте
Процедура УлицаПриИзменении(Элемент)
	УлицаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьВводОстатковПоИскуНаСервере()

	Сообщить("Записали");
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьВводОстатковПоИску(Команда)
	ЗадатьВопросОЗаписи();
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВопросОЗаписи()

	Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопрос",
	ЭтотОбъект); // Прописываем название процедуры-обработчика.
	
	ПоказатьВопрос(Оповещение, "Перед вводом документа ввода остатков необходимо записать элемент. Записать?",  // вместо привычного "Вопрос", теперь "ПоказатьВопрос"
	РежимДиалогаВопрос.ДаНетОтмена,
	0,  // задержка (секунды). необязательно
	КодВозвратаДиалога.Да, // задает кнопку по умолчанию. необязательно
	"Предупреждение о необходимости записи элемента справочника." // устанавливаем заголовок. необязательно
);

КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопрос(Результат, Параметры) Экспорт// здесь, думаю, комментировать нечего
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Записать();
		СтрДанные = Новый Структура("Основание", Объект.Ссылка);
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", СтрДанные);
		ОткрытьФорму("Документ.ЛаРС_ВводЗадолженностиПоИску.ФормаОбъекта", ПараметрыФормы);
	КонецЕсли;
КонецПроцедуры
